In [1]:
import mysql.connector as conn
import pandas as pd

In [2]:
mydb=conn.connect(host='localhost', user='root',password='mysql')

In [3]:
cursor=mydb.cursor()

In [4]:
cursor.execute('show databases')

In [5]:
cursor.fetchall()

[('bank',),
 ('ineuron',),
 ('ineuron1',),
 ('information_schema',),
 ('mysql',),
 ('org',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [6]:
cursor.execute('use org')

In [7]:
cursor.execute('show tables')

In [8]:
cursor.fetchall()

[('data',), ('worker',)]

In [9]:
cursor.execute('create table WORK (WORKER_ID int(15), FIRST_NAME varchar(25), LAST_NAME char(25), WAGE INT(15),JOINING_DATE DATETIME,DEPARTMENT char(10));')

In [11]:
cursor.execute("INSERT INTO Work (WORKER_ID, FIRST_NAME, LAST_NAME, WAGE, JOINING_DATE, DEPARTMENT) VALUES(001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),(002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),(003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),(004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),(005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),(006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),(007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),(008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')")

In [12]:
cursor.execute('select * from work')

In [13]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (2,
  'Niharika',
  'Verma',
  80000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Admin'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin'),
 (5, 'Vivek', 'Bhati', 500000, datetime.datetime(2014, 6, 11, 9, 0), 'Admin'),
 (6,
  'Vipul',
  'Diwan',
  200000,
  datetime.datetime(2014, 6, 11, 9, 0),
  'Account'),
 (7,
  'Satish',
  'Kumar',
  75000,
  datetime.datetime(2014, 1, 20, 9, 0),
  'Account'),
 (8,
  'Geetika',
  'Chauhan',
  90000,
  datetime.datetime(2014, 4, 11, 9, 0),
  'Admin')]

# Q-1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014.

In [16]:
cursor.execute("select * from work where joining_date between '2014-02-01' and '2014-02-28'")

In [17]:
cursor.fetchall()

[(1, 'Monika', 'Arora', 100000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (3, 'Vishal', 'Singhal', 300000, datetime.datetime(2014, 2, 20, 9, 0), 'HR'),
 (4,
  'Amitabh',
  'Singh',
  500000,
  datetime.datetime(2014, 2, 20, 9, 0),
  'Admin')]

In [18]:
pd.read_sql("select * from work where joining_date between '2014-02-01' and '2014-02-28'",mydb)

   WORKER_ID FIRST_NAME LAST_NAME    WAGE        JOINING_DATE DEPARTMENT
0          1     Monika     Arora  100000 2014-02-20 09:00:00         HR
1          3     Vishal   Singhal  300000 2014-02-20 09:00:00         HR
2          4    Amitabh     Singh  500000 2014-02-20 09:00:00      Admin

# Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [21]:
cursor.execute("select first_name, wage, department, joining_date, count(*) from work group by department")

In [22]:
cursor.fetchall()

[('Monika', 100000, 'HR', datetime.datetime(2014, 2, 20, 9, 0), 2),
 ('Niharika', 80000, 'Admin', datetime.datetime(2014, 6, 11, 9, 0), 4),
 ('Vipul', 200000, 'Account', datetime.datetime(2014, 6, 11, 9, 0), 2)]